import React from 'react';
import WcIcon from '@mui/icons-material/Wc';

export const scenarioFlowTitles = {
  students: '專為剛畢業的你所打造',
  workers: '',
  couples: '',
  business: '',
  retirees: '',
};
export const scenarioFlows = {
  students: [
    { label: '開始還學貸囉', icon: <WcIcon /> },
    { label: '如何申請薪轉戶', icon: <WcIcon /> },
    { label: '幫自己保一張職業工作意外險吧', icon: <WcIcon /> },
    { label: '定期信用卡繳款', icon: <WcIcon /> },
  ],
  workers: [],
  couples: [],
  business: [],
  retirees: [],
};

export const scenarioFlowDetails = {
  students: [
    {
      title: '開始還學貸囉',
      content:
        '首先，我想要謝謝每一個願意花時間寫溫暖的訊息關心我的每一個你，我的心情很沈重，所以還沒能一一回覆。我想先讓你們知道，也許對你來說只是一個小小的舉動，但對我來說意義很重大。謝謝你們在我人生最困難的時候給了我很大的安慰和力量。\n\n寫這封信是我做過最困難的決定，人生真的很不容易。我想，也只有這樣勇敢坦承的面對一切才能歸零，我們才能有各自有重生的機會，也希望我的分享能帶給深陷其中的你或是即將要踏入這個旅程的你一些省思。',
      image: '/assets/scenario/scenario-01.png',
      backgroundColor: '#E3A6A1',
    },
    {
      title: '如何申請薪轉戶',
      content:
        '踏入婚姻的時候我以為我們一輩子就會是一家人了，所以我全心全意地為我們的家庭付出我的所有。因為你比我大十歲又很希望有很多孩子，一胎接一胎不停的催生，所以我放棄工作和自己個人的人生，一切以你和孩子為中心，我們結婚大部分時間，我不是在備孕，懷孕，就是在產後哺乳育兒，過程中身心都經歷了很多變化，大部分我都是自己獨自面對的。當然，我自己也喜歡孩子，也是我自己要答應生的，但如果我當初知道我生完這三個孩子你就會因為想過“單身”的生活而離開我們家，我會需要自己過著偽單親的日子帶大三個孩子，我是不會答應的。你也很清楚知道，我從小到大最大的夢想就是組建一個和諧的家庭，讓我的孩子能在一個完整有愛的家庭長大。但，我沒有後悔，因為我們三個孩子是myeverything，是上帝最大的恩典。',
      image: '/assets/scenario/scenario-01.png',
      backgroundColor: '#19B3B1',
    },
    {
      title: '幫自己保一張職業工作意外險吧',
      content:
        '現代的女性不像從前的女性沒有教育的機會，在家庭中沒有選擇的只能擔任妻子和母親的角色。我們很幸運的有機會接受高等教育，有知識，學識，也有機會見識，也有謀生能力，也同樣能為社會貢獻，無論是過去或是現代的女性選擇為家庭全心付出當家庭主婦，雖然實質上是屬於”無酬”的工作。但，這只是家庭成員角色的分配，也是家中重要的支撐，甚至是一個全年無休，24小時多重角色(例如:保姆/老師/打掃阿姨/司機/總管/伴侶/特助等工作)。這份工作的薪酬應該加總計算加上以你的能力不外出工作的機會成本。這應是所有家庭主婦透過自己努力應得的薪酬，而不是被贈與或施捨的，被分配到這個角色的人不應該是理所應當要永遠沒有經濟能力或積蓄，而擔任在外工作的那一方獲得所有的利益和權利。這樣會形成不對等的關係，也會讓女性處於弱勢，即便男生出軌或家暴也難以有話語權。',
      image: '/assets/scenario/scenario-01.png',
      backgroundColor: '#034B61',
    },
    {
      title: '定期信用卡繳款',
      content:
        '我覺得這是我們這一代人需要一起省思的議題。我身邊的家庭主婦很多戶頭裡都沒有自己的積蓄或收入，平時用先生賺來的錢也會感到不好意思，用錢也會自己看看先生的臉色，也絕不敢開口說想要照顧自己父母，女性如果開口聊到錢的話題就會被我們的社會譴責為市信或是質疑是不是拜金女，只是圖男生的錢。對於長期都以家庭為重，沒有在外工作的女性，如果沒有做錯什麼卻因為男方無正當理由而被迫離婚，通常會不知所措。所以女孩們!一定要好好的防範於未然，我從來也沒有想過自己會經歷這些你也許也會跟我一樣覺得不可能!但未雨綢繆的為自己和孩子的將來做打算一定沒錯。',
      image: '/assets/scenario/scenario-01.png',
      backgroundColor: '#002C2F',
    },
  ],
  workers: [],
  couples: [],
  business: [],
  retirees: [],
};
